Config/Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>LoyaltyType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoyaltyType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ClientTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Identifier</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlocked</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Consumer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SourcesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TurnOffAutomaticDiscounts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Folio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateHotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/Integrations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Integrations</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Accounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AleanCRS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AtolOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Availpro</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bitrix24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bonuses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BroniruiOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DADATA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalLogSystem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalLoyaltySystem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIAS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fitnes1C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GuestJoy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HAFELE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotbot</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotel365</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotellab</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HotelOnlineBooking</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hoteza</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HPG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Igloorooms</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocksOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JCCSmart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ordes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OTAGateway</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PassportBoxREST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QRCodePaySberbank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>rkeeper</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roscongress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RTK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SamsungLYNK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sanatorium</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SelfService</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Siteminder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKKV2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SquirrelPOS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Travelline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ttLock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UHotels</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnisenderGO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebHotelier</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wubook</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YandexTV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YandexVision</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Guestlink</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/DiscountCards/Forms/tcReplaceCardForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Parameters.Property("DiscountCard") Then   
		DiscountCard = Parameters.DiscountCard;  
		Client = DiscountCard.Client;
	EndIf; 
	If ValueIsFilled(DiscountCard.DiscountType) And DiscountCard.DiscountType.ExternalBonusSystemIsUsed And ValueIsFilled(DiscountCard.DiscountType.ExternalInteraction) Then
		ExternalInteraction = DiscountCard.DiscountType.ExternalInteraction;
		If ExternalInteraction.IntegrationType = Enums.Integrations.ISD Then
			Items.Identifier.ReadOnly = True;	
		EndIf;	
	EndIf;	
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure OnOpen(Cancel)  
	If Not ValueIsFilled(DiscountCard) Then 
		ShowMessageBox(New NotifyDescription("CloseForm", ThisObject), Nstr("en = 'Card ref not sent'; de = 'Kartenreferenz nicht gesendet'; ru = 'Не передана ссылка на карту'"));
	EndIf; 
	CurrentItem = Items.Identifier;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure ExternalEvent(pSource, pEvent, pData)
	If Not IsInputAvailable() Then
		Return;
	EndIf;
	
	vEventData = tcConnectionHardwareAtClient.cmGetExternalEventResultInputDevice(pSource, pEvent, pData);
	If IsBlankString(vEventData.DeviceData) Then
		Return;
	EndIf;
	
	If vEventData.DeviceType = "MagneticStripeCardReader" Then
		Identifier = GetCardIDPresantation(vEventData.DeviceData, ExternalInteraction);
		ReplaceCard();
		If IsBlankString(LabelNotification) Then
			Notify("Catalog.DiscountCards.Changed", Client);
			Close();
		EndIf;
	EndIf;
EndProcedure // ExternalEvent

#EndRegion

#Region FormCommandsEventHandlers

 // -----------------------------------------------------------------------------
&AtClient
Procedure Replacing(Command)
	If CheckFilling() Then
		ReplaceCard();
		If IsBlankString(LabelNotification) Then
			Notify("Catalog.DiscountCards.Changed", Client);
			Close();
		EndIf;	
	EndIf;	

EndProcedure

#EndRegion

#Region Private
 
 // -----------------------------------------------------------------------------
&AtClient
Procedure CloseForm(pParams) Export
	ThisForm.Close();	
EndProcedure

// -----------------------------------------------------------------------------
&AtServerNoContext
Function GetCardIDPresantation(pID, pExternalInteraction)  
	If ValueIsFilled(pExternalInteraction) And pExternalInteraction.IntegrationType = Enums.Integrations.ISD Then 
		vID = pID;
		Try
			If Not StrLen(pID) = 20 Then
				vID =  Format(Number(GetBinaryDataBufferFromHexString(pID).ReadInt64(0, ByteOrder.BigEndian)),"NG=0");
			EndIf;	
		Except
		EndTry;
	EndIf;
	Return vID;
EndFunction //  GetCardIDPresantation()

// -----------------------------------------------------------------------------
&AtServer
Function GetISDTestCardParams(pCardID, pRateCode) 
	vKeyParams = New Structure;   
	vKeyParams.Insert("media_num", pCardID);
	vKeyParams.Insert("tariff_id", pRateCode); 
	vKeyParams.Insert("pointsale", ISD.GetPSALID(ExternalInteraction));
	vKeyParams.Insert("Workstation",  String(SessionParameters.CurrentWorkstation));
	vKeyParams.Insert("Hotel", String(SessionParameters.CurrentHotel));
	vKeyParams.Insert("User", String(SessionParameters.CurrentUser));
	Return vKeyParams;
EndFunction  

// -----------------------------------------------------------------------------   
&AtServer
Procedure ReplaceCard()
	If IsBlankString(Identifier) Then
		Return;
	EndIf;   
	LabelNotification = "";
	// Try to search discount card with this Id
	vDiscountCard = cmGetDiscountCardById(TrimAll(Identifier));
	If ValueIsFilled(vDiscountCard) And vDiscountCard.Client <> DiscountCard.Client Then
		LabelNotification = NStr("en='This card is already registered!';ru='Эта карта уже зарегистрирована!';de='Diese Karte ist bereits registriert!'") + " " + String(vDiscountCard);
		Items.LabelNotification.Visible = True;
		Return;
	EndIf;  
	// Update data from ISD
	If ValueIsFilled(ExternalInteraction) And ExternalInteraction.IntegrationType = Enums.Integrations.ISD Then 
		// Call ISD
		ReplaceInISD(); 
	Else
		// Update
		vDCObj = DiscountCard.GetObject(); 
		If Not IsBlankString(Remarks) Then
			vDCObj.Remarks = Remarks;
		EndIf;
		vDCObj.Identifier = Identifier; 
		vDCObj.Write();
	EndIf; 
EndProcedure

// -----------------------------------------------------------------------------
&AtServerNoContext
Function GetTariff(pExternalInteraction, pIsMain = True)
	vHotel = SessionParameters.CurrentHotel;
	vTariff = "";
	vTariffs = InformationRegisters.ExternalSystemIntegrationData.GetData(pExternalInteraction, "BonusRates");  
	If vTariffs.Count() > 0 Then
		// Try find by hotel
		vFilter = vTariffs.FindRows(New Structure("IsDefault, Hotel", pIsMain, vHotel)); 	
		If vFilter.Count() > 0 Then  
			vRow = vFilter[0];
			vTariff = vRow.ISDCode;
		Else
			vFilter = vTariffs.FindRows(New Structure("IsDefault", pIsMain)); 	
			If vFilter.Count() > 0 Then  
				vRow = vFilter[0];
				vTariff = vRow.ISDCode;
			EndIf;
		EndIf;
	EndIf;
	
	Return vTariff;
EndFunction	

// -----------------------------------------------------------------------------   
&AtServer
Procedure ReplaceInISD()
	vTariff = GetTariff(ExternalInteraction, Not ValueIsFilled(DiscountCard.Parent)); 
	If IsBlankString(vTariff) Then
		LabelNotification = NStr("en = 'ISD tariff mapping not configured!'; de = 'ISD-Tarifzuordnung nicht konfiguriert!'; ru = 'Не настроен маппинг тарифов ISD!'");
		Items.LabelNotification.Visible = True;
		Return;
	EndIf; 
	vKeyParams = GetISDTestCardParams(Identifier, vTariff);
	// Check card in ISD
	vRes = ISD.TestCard(ExternalInteraction, vKeyParams);
	If Not vRes.Success Then
		LabelNotification = ?(Not IsBlankString(vRes.StatusDescription), vRes.StatusDescription, vRes.MapResponse.Get("descr"));
		Items.LabelNotification.Visible = True;
		Return;	
	EndIf;	
	vKeyParams = New Structure;   
	vKeyParams.Insert("Card",           Undefined);
	vKeyParams.Insert("KeyOldID", 		DiscountCard.Identifier);
	vKeyParams.Insert("KeyNewID",		Identifier);   
	vKeyParams.Insert("WorkstationID",	ISD.GetPSALID(ExternalInteraction));
	// 
	vRes = ISD.ReplaceCard(ExternalInteraction, vKeyParams);
	If Not vRes.Success Then
		LabelNotification = ?(Not IsBlankString(vRes.StatusDescription), vRes.StatusDescription, vRes.MapResponse.Get("descr"));
		Items.LabelNotification.Visible = True;
		Return;	
	EndIf;	
	// Update
	vDCObj = DiscountCard.GetObject(); 
	If Not IsBlankString(Remarks) Then
		vDCObj.Remarks = Remarks;
	EndIf;
	vDCObj.Identifier = Identifier; 
	vDCObj.Write();
EndProcedure
 
 #EndRegion
